### SQL in 10 Minutes
#### Lesson II
`select`, `order by` & `filter`

In [1]:
import sqlite3 
import pandas as pd

In [2]:
db = 'tysql.sqlite'
conn = sqlite3.connect(db)

Here we make it even simpler to list all tables for sqlite3 using pandas compared to our Intro notebook

In [3]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)

In [4]:
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...

In [5]:
tables['name'].reset_index()

   index        name
0      0   Customers
1      1  OrderItems
2      2      Orders
3      3    Products
4      4     Vendors

In this lesson II, we start with the table `Products`.

In [7]:
sql = """
        select * 
        from Products;
        """

In [8]:
ex1 = pd.read_sql_query(sql, conn)
ex1.head()

,prod_id,vend_id,prod_name,prod_price,prod_desc
0,BR01,BRS01,8 inch teddy bear,5.99,"8 inch teddy bear, comes with cap and jacket"
1,BR02,BRS01,12 inch teddy bear,8.99,"12 inch teddy bear, comes with cap and jacket"
2,BR03,BRS01,18 inch teddy bear,11.99,"18 inch teddy bear, comes with cap and jacket"
3,BNBG01,DLL01,Fish bean bag toy,3.49,"Fish bean bag toy, complete with bean bag worm..."
4,BNBG02,DLL01,Bird bean bag toy,3.49,"Bird bean bag toy, eggs are not included"

See that the form of sql language before implementation with pandas is similar to bigquery.

In [9]:
sql = """
        select prod_id, prod_name, prod_price
        from Products;
        """

In [10]:
ex2 = pd.read_sql_query(sql, conn)
ex2.head()

  prod_id           prod_name  prod_price
0    BR01   8 inch teddy bear        5.99
1    BR02  12 inch teddy bear        8.99
2    BR03  18 inch teddy bear       11.99
3  BNBG01   Fish bean bag toy        3.49
4  BNBG02   Bird bean bag toy        3.49

key = DISTINCT

In [11]:
sql = """
        select distinct vend_id
        from Products;
        """
ex3 = pd.read_sql_query(sql, conn)
ex3

  vend_id
0   BRS01
1   DLL01
2   FNG01

Restricts: different depending on environment, here we use `limit` clause

In [16]:
sql = """
        select prod_name
        from Products
        limit 6;
        """
ex4 = pd.read_sql_query(sql, conn)
ex4

             prod_name
0    8 inch teddy bear
1   12 inch teddy bear
2   18 inch teddy bear
3    Fish bean bag toy
4    Bird bean bag toy
5  Rabbit bean bag toy

In [17]:
# compare the following with ex2
sql = """
        select prod_name
        from Products
        order by prod_name;
        """
ex5 = pd.read_sql_query(sql, conn)
ex5

             prod_name
0   12 inch teddy bear
1   18 inch teddy bear
2    8 inch teddy bear
3    Bird bean bag toy
4    Fish bean bag toy
5            King doll
6           Queen doll
7  Rabbit bean bag toy
8          Raggedy Ann

In [19]:
sql = """
        select prod_id, prod_name, prod_price
        from Products
        order by prod_name, prod_price;
        """
ex6 = pd.read_sql_query(sql, conn)
ex6

  prod_id            prod_name  prod_price
0    BR02   12 inch teddy bear        8.99
1    BR03   18 inch teddy bear       11.99
2    BR01    8 inch teddy bear        5.99
3  BNBG02    Bird bean bag toy        3.49
4  BNBG01    Fish bean bag toy        3.49
5   RYL01            King doll        9.49
6   RYL02           Queen doll        9.49
7  BNBG03  Rabbit bean bag toy        3.49
8  RGAN01          Raggedy Ann        4.99

In [20]:
sql = """
        select prod_id, prod_name, prod_price
        from Products
        order by prod_price, prod_name;
        """
ex7 = pd.read_sql_query(sql, conn)
ex7

  prod_id            prod_name  prod_price
0  BNBG02    Bird bean bag toy        3.49
1  BNBG01    Fish bean bag toy        3.49
2  BNBG03  Rabbit bean bag toy        3.49
3  RGAN01          Raggedy Ann        4.99
4    BR01    8 inch teddy bear        5.99
5    BR02   12 inch teddy bear        8.99
6   RYL01            King doll        9.49
7   RYL02           Queen doll        9.49
8    BR03   18 inch teddy bear       11.99

So it is clear in the above result that `order by` follow orders in the clause, only when same rows appear in the order column, the second column in `order by` works.

In [21]:
sql = """
        select prod_id, prod_name, prod_price
        from Products
        order by 2, 3;
        """
ex8 = pd.read_sql_query(sql, conn)
ex8

  prod_id            prod_name  prod_price
0    BR02   12 inch teddy bear        8.99
1    BR03   18 inch teddy bear       11.99
2    BR01    8 inch teddy bear        5.99
3  BNBG02    Bird bean bag toy        3.49
4  BNBG01    Fish bean bag toy        3.49
5   RYL01            King doll        9.49
6   RYL02           Queen doll        9.49
7  BNBG03  Rabbit bean bag toy        3.49
8  RGAN01          Raggedy Ann        4.99

In [22]:
sql = """
        select prod_id, prod_price, prod_name
        from Products
        order by prod_price desc;
        """
ex8 = pd.read_sql_query(sql, conn)
ex8

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL01        9.49            King doll
2   RYL02        9.49           Queen doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG01        3.49    Fish bean bag toy
7  BNBG02        3.49    Bird bean bag toy
8  BNBG03        3.49  Rabbit bean bag toy

In [24]:
# DESC only refers to the column before itself
sql = """
        select prod_id, prod_price, prod_name
        from Products
        order by prod_price desc, prod_name desc;
        """
ex9 = pd.read_sql_query(sql, conn)
ex9

  prod_id  prod_price            prod_name
0    BR03       11.99   18 inch teddy bear
1   RYL02        9.49           Queen doll
2   RYL01        9.49            King doll
3    BR02        8.99   12 inch teddy bear
4    BR01        5.99    8 inch teddy bear
5  RGAN01        4.99          Raggedy Ann
6  BNBG03        3.49  Rabbit bean bag toy
7  BNBG01        3.49    Fish bean bag toy
8  BNBG02        3.49    Bird bean bag toy

Filter with `where`

In [25]:
sql = """
        select prod_id, prod_price, prod_name
        from Products
        where prod_price = 3.49;
        """
ex10 = pd.read_sql_query(sql, conn)
ex10

  prod_id  prod_price            prod_name
0  BNBG01        3.49    Fish bean bag toy
1  BNBG02        3.49    Bird bean bag toy
2  BNBG03        3.49  Rabbit bean bag toy

In [28]:
sql = """
        select prod_id, prod_price, prod_name
        from Products
        where prod_price <> 9.49;
        """
ex11 = pd.read_sql_query(sql, conn)
ex11

  prod_id  prod_price            prod_name
0    BR01        5.99    8 inch teddy bear
1    BR02        8.99   12 inch teddy bear
2    BR03       11.99   18 inch teddy bear
3  BNBG01        3.49    Fish bean bag toy
4  BNBG02        3.49    Bird bean bag toy
5  BNBG03        3.49  Rabbit bean bag toy
6  RGAN01        4.99          Raggedy Ann

In [29]:
sql = """
        select vend_id, prod_name
        from Products
        where vend_id <> 'DLL01';
        """
ex12 = pd.read_sql_query(sql, conn)
ex12

  vend_id           prod_name
0   BRS01   8 inch teddy bear
1   BRS01  12 inch teddy bear
2   BRS01  18 inch teddy bear
3   FNG01           King doll
4   FNG01          Queen doll

In [31]:
sql = """
        select prod_name, prod_price
        from Products
        where prod_price between 4.99 and 11.99;
        """
ex13 = pd.read_sql_query(sql, conn)
ex13

            prod_name  prod_price
0   8 inch teddy bear        5.99
1  12 inch teddy bear        8.99
2  18 inch teddy bear       11.99
3         Raggedy Ann        4.99
4           King doll        9.49
5          Queen doll        9.49

So we see `between` will include values of terminals

`NULL` checking

In [32]:
sql = """
        select prod_name
        from Products
        where prod_price is null;
        """
ex14 = pd.read_sql_query(sql, conn)
ex14

Empty DataFrame
Columns: [prod_name]
Index: []

In [33]:
sql = """
        select prod_name
        from Products
        where prod_price is not null;
        """
ex15 = pd.read_sql_query(sql, conn)
ex15

             prod_name
0    8 inch teddy bear
1   12 inch teddy bear
2   18 inch teddy bear
3    Fish bean bag toy
4    Bird bean bag toy
5  Rabbit bean bag toy
6          Raggedy Ann
7            King doll
8           Queen doll

In [35]:
sql = """
        select cust_name
        from CUSTOMERS
        where cust_email is null;
        """
ex16 = pd.read_sql_query(sql, conn)
ex16

       cust_name
0     Kids Place
1  The Toy Store